app/Http/Livewire/AuthorProfileHeader.php

    public function mount()
    {
        $this->author = User::find(auth('web')->id());
---
select * from `users` where `users`.`id` = 1 limit 1