app/Http/Livewire/AuthorPersonalDetails.php

    public function mount()
    {
        $this->author = User::find(auth('web')->id());
---
select * from `users` where `users`.`id` = 1 limit 1

    public function UpdateDetails()
    {
        $this->validate([
            'name' => 'required|string',
            'username' => 'required|unique:users,username,' . auth('web')->id()
        ]);

        User::where('id', auth('web')->id())->update([
            'name' => $this->name,
            'username' => $this->username,
            'biography' => $this->biography
        ]);
---
update `users` set `name` = 'GNJThings', `username` = 'gnjblogs', `biography` = 'Hi im gianne and from (PH)uck all of you!', `users`.`updated_at` = '2024-11-02 07:52:06' where `id` = 1